In [160]:
import pandas as pd

#Load tha data set
df1 = pd.read_csv("Patient_Data.csv")
df2 = pd.read_csv("Billing_Data.csv")
#displays data type information for every variable
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PatientID       6 non-null      int64
 1   Name            6 non-null      object
 2   Department      6 non-null      object
 3   Doctor          6 non-null      object
 4   BillAmount      4 non-null      float64
 5   ReceptionistID  6 non-null      int64
 6   CheckInTime     6 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 468.0+ bytes

In [161]:
#Droping the unwanted columns from the data while printing(Not permanently)
df1 = df1.drop(df1.columns[[5,6]],axis=1)
df1

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN
5        101    Alice   Cardiology  Dr. Smith      5000.0

In [162]:
#Selecting only billing revelant columns by neglecting Name
df1=df1[['PatientID', 'Department', 'Doctor', 'BillAmount']]
df1

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN
5        101   Cardiology  Dr. Smith      5000.0

In [163]:
# Total BillAmount per department(duplicates included)
Total_BillAmount = df1.groupby('Department')['BillAmount'].sum()
Total_BillAmount

Department
Cardiology     16200.0
Dermatology        0.0
Neurology          0.0
Orthopedics     7500.0
Name: BillAmount, dtype: float64

In [164]:
#Dropping duplicates records
df1 = df1.drop_duplicates(subset='PatientID')
df1

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN

In [165]:
import numpy as np

#Finding mean value for bill amount to fill missing value with 2decimal places
Mean = np.round(df1['BillAmount'].mean(),2)
print(Mean)

6233.33

In [130]:
#Fill the blank with mean value
df1["BillAmount"].fillna(value=Mean,inplace=True)
df1

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_11468\3761733176.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1["BillAmount"].fillna(value=Mean,inplace=True)
C:\Users\ADMIN\AppData\Local\Temp\ipykernel_11468\3761733176.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1["BillAmount"].fillna(value=Mean,inplace=True)

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith     5000.00
1        102    Neurology   Dr. John     6233.33
2        103  Orthopedics    Dr. Lee     7500.00
3        104   Cardiology  Dr. Smith     6200.00
4        105  Dermatology   Dr. Rose     6233.33

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith     5000.00
1        102      Bob    Neurology   Dr. John     6233.33
2        103  Charlie  Orthopedics    Dr. Lee     7500.00
3        104    David   Cardiology  Dr. Smith     6200.00
4        105      Eva  Dermatology   Dr. Rose     6233.33
   PatientID  InsuranceCovered  FinalAmount
0        101              2000         3000
1        102              1500         3500
2        103              2500         5000
3        104              3000         3200
4        105              1000         4000

In [152]:
#Merging the billing dataset with patient dataset on PatientID by using concat.
merged_df = pd.merge(df1,df2, on='PatientID')
merged_df

,PatientID,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Cardiology,Dr. Smith,5000.00,2000,3000
1,102,Neurology,Dr. John,6233.33,1500,3500
2,103,Orthopedics,Dr. Lee,7500.00,2500,5000
3,104,Cardiology,Dr. Smith,6200.00,3000,3200
4,105,Dermatology,Dr. Rose,6233.33,1000,4000

In [144]:
#Creating dataFrame for new patients(row-wise concat)
new_patients_row = pd.DataFrame({
    'PatientID': [106, 107],
    'Department': ['Cardiology', 'Orthopedics'],
    'Doctor': ['Dr.Lee', 'Dr Mehta'],
    'BillAmount': [7000, 8500],
})

#creating dataFrame for new patients(Column-wise concat)
new_billing_columns = pd.DataFrame({
    'InsuranceCovered': [2500,3000],
    'FinalAmount': [7000,8500]
})

In [157]:
#Concatenate new patients (concadinating column wise)
result_data_set = pd.concat([new_patients_row,new_billing_columns],axis=1)
result_data_set

   PatientID   Department    Doctor  BillAmount  InsuranceCovered  FinalAmount
0        106   Cardiology    Dr.Lee        7000              2500         7000
1        107  Orthopedics  Dr Mehta        8500              3000         8500

In [159]:
# Concatenates merged and new patient data row-wise, resets index, and starts indexing from 1
Final_dataset = pd.concat([merged_df,result_data_set],ignore_index=True)
Final_dataset.index+=1

#This is the final cleaned data set
Final_dataset

,PatientID,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
1,101,Cardiology,Dr. Smith,5000.00,2000,3000
2,102,Neurology,Dr. John,6233.33,1500,3500
3,103,Orthopedics,Dr. Lee,7500.00,2500,5000
4,104,Cardiology,Dr. Smith,6200.00,3000,3200
5,105,Dermatology,Dr. Rose,6233.33,1000,4000
6,106,Cardiology,Dr.Lee,7000.00,2500,7000
7,107,Orthopedics,Dr Mehta,8500.00,3000,8500